Repository: duda4418/Troubleshooting-Chatbot-with-Image-Analysis
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ro

source: Solved
ro: Rezolvat

source: Not solved
ro: Nerezolvat

source: More options
ro: Mai multe opțiuni

source: Try again
ro: Încearcă din nou

source: Choose language
ro: Alege limba

source: Actions / Steps:
ro: Acțiuni / Pași:

source: Identified: {label} (confidence {conf:.2f})
ro: Identificat: {label} (încredere {conf:.2f})

source: Analyze error: {text}
ro: Eroare la analiză: {text}

source: Chat error: {text}
ro: Eroare la conversație: {text}

source: Session reset.
ro: Sesiunea a fost resetată.

source: Session Info
ro: Informații sesiune

source: Label
ro: Etichetă

source: Confidence
ro: Încredere

source: Phase
ro: Fază

source: Reset Session
ro: Resetează sesiunea

source: Last raw response
ro: Ultimul răspuns brut

source: API Call Logs
ro: Jurnal apeluri API

source: Error
ro: Eroare

source: Analyze
ro: Analiză

source: Guidance
ro: Ghidare

source: History
ro: Istoric

source: Analyze Image
ro: Analizează imaginea

source: Upload result photo
ro: Încarcă fotografia rezultatului

source: Context notes (optional)
ro: Note contextuale (opțional)

source: Run Analysis
ro: Pornește analiza

source: Analyzing...
ro: Se analizează...

source: Go to Guidance tab to start troubleshooting.
ro: Mergi la fila Ghidare pentru a începe depanarea.

source: Tailored Guidance
ro: Ghidare personalizată

source: Analyze an image first.
ro: Analizează mai întâi o imagine.

source: analyzed
ro: analizată

source: intro
ro: introducere

source: steps
ro: pași

source: alternatives
ro: alternative

source: end
ro: final

source: Start Troubleshooting
ro: Pornește depanarea

source: assistant
ro: asistent

source: you
ro: tu

source: Need an active session.
ro: Este necesară o sesiune activă.

source: Finish troubleshooting to enable feedback.
ro: Finalizează depanarea pentru a trimite feedback.

source: Problem solved?
ro: Problema a fost rezolvată?

source: Notes / suggestions
ro: Note / sugestii

source: Submit Feedback
ro: Trimite feedback

source: Thank you for your feedback!
ro: Mulțumim pentru feedback!

source: Feedback error: {text}
ro: Eroare la trimiterea feedbackului: {text}

source: No messages yet.
ro: Nicio conversație încă.

source: Clear History
ro: Șterge istoricul

source: History cleared.
ro: Istoricul a fost șters.

source: Chat History
ro: Istoric conversație

source: Export JSON
ro: Exportă JSON

source: Export Markdown
ro: Exportă Markdown

source: Fresh UI rebuilt from backend logic. Use sidebar for debug & reset.
ro: Interfață reconstruită din logica backend. Folosește bara laterală pentru depanare și reset.

source: Request
ro: Cerere

source: Tip
ro: Sugestie

source: Guide
ro: Ghid

source: Setting
ro: Setare

source: Maintenance
ro: Întreținere

source: Placement
ro: Amplasare

source: capture
ro: captură

source: lighting
ro: iluminare

source: angle
ro: unghi

source: device
ro: dispozitiv

source: rinse aid
ro: agent de clătire

source: cycle
ro: ciclu

source: spray arms
ro: brațe de pulverizare

source: retake with full rack visible
ro: re-fotografiază cu raftul complet vizibil

source: use room light, no flash
ro: folosește lumina camerei, fără bliț

source: capture top and bottom rack
ro: surprinde raftul superior și inferior

source: include close-up of glass or plate
ro: include un prim-plan al paharului sau farfuriei

source: upper rack, front
ro: raft superior, partea din față

source: check and clean
ro: verifică și curăță

source: intensive
ro: intensiv
